Revit 2026 API

# ViewScheduleBodyTextTypeId Property

---

Defines the default text style used for the data section of the schedule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId BodyTextTypeId { get; set; }
```
```vb
Public Property BodyTextTypeId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ BodyTextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member BodyTextTypeId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The text type id doesn't represent a valid text type element. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

Columns may override the default style.

#### Reference

ViewSchedule Class

Autodesk.Revit.DB Namespace